tests/HeleShaw/channel2D/src/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:                                        |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



application         interHeleShawFoam;

startFrom           latestTime;

startTime           0;

stopAt              endTime;

endTime             1.0;

deltaT              1e-8;

writeControl        adjustableRunTime;

// writeControl        timeStep;

writeInterval       0.1;

// writeInterval       1;

purgeWrite          0;

writeFormat         ascii;

writePrecision      10;

writeCompression    uncompressed;

timeFormat          general;

timePrecision       10;

runTimeModifiable   yes;

adjustTimeStep      yes;

maxCo               0.1;
maxAlphaCo          0.1;

maxDeltaT           $writeInterval;

libs (
    "libOpenFOAM.so"
);

functions
{
    #includeFunc    residuals(alpha.phase1, p_rgh, U)
    #includeFunc    patchFlowRate(patch=left)
    #includeFunc    cellMaxMag(U)

    processorField1
    {
        type            processorField;
        libs            ("libfieldFunctionObjects.so");
        writeControl    writeTime;
        writeInterval   1;
    }

//     massOfGas
//     {
//         type            volFieldValue;
//         libs            ("libfieldFunctionObjects.so");
//         log             true;
//         writeControl    writeTime;
//         writeFields     false;
//         regionType      all;
//         operation       volIntegrate;
// 
//         fields
//         (
//             rho
//         );
//     }
    /*CodeStream section*/
//     #include        "inputOutputMassFlowLUFO"
//     #include        "bubbleRadiusLUFO"
//     #include        "bubbleMassConservationLUFO"
//     #include        "centerOfMassLUFO"
};

OptimisationSwitches
{
    // On NFS mounted file system: maximum wait for files to appear/get
    // updated. Set to 0 on distributed case.
    fileModificationSkew 10;

    //- Modification checking:
    //  - timeStamp         : use modification time on file
    //  - inotify           : use inotify framework
    //  - timeStampMaster   : do time stamp (and file reading) only on master.
    //  - inotifyMaster     : do inotify (and file reading) only on master.
    fileModificationChecking timeStampMaster;

    //- Parallel IO file handler
    //  uncollated (default), collated or masterUncollated
    fileHandler uncollated;

    //- collated: thread buffer size for queued file writes.
    //  If set to 0 or not sufficient for the file size threading is not used.
    //  Default: 2e9
    maxThreadFileBufferSize 2e9;

    //- masterUncollated: non-blocking buffer size.
    //  If the file exceeds this buffer size scheduled transfer is used.
    //  Default: 2e9
    maxMasterFileBufferSize 2e9;

    commsType       nonBlocking; // scheduled; // blocking;
    floatTransfer   0;
    nProcsSimpleSum 0;

    // Force dumping (at next timestep) upon signal (-1 to disable)
    writeNowSignal              -1; // 10;

    // Force dumping (at next timestep) upon signal (-1 to disable) and exit
    stopAtWriteNowSignal        -1;
}


// ************************************************************************* //
