tests/HeleShaw/channel2D/src/constant/physicalProperties.phase2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties.phase2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

viscosityModel  constant;

nu              1e-06;

rho             1000;

// thermoType
// {
//     type            heRhoThermo;
//     mixture         pureMixture;
//     properties      liquid;
//     energy          sensibleInternalEnergy;
// }
// 
// mixture
// {
//     H2O;
// }


// ************************************************************************* //
