tests/HeleShaw/channel2D/src/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
    left
    {
        type            fixedValue;
        value           uniform (0.005 0 0);

//         type            pressureInletOutletVelocity;
//         phi             phi;
//         tangentialVelocity (0 0 0);
//         value           uniform (0 0 0);
//         type            pressureNormalInletOutletVelocity;
//         phi             phi;
//         rho             rho;
//         value           uniform (0 0 0);
    }
    bottom
    {
        type            slip;
    }
    right
    {
//         type            fixedValue;
//         value           uniform (0.01 0 0);

        type            pressureNormalInletOutletVelocity;
        phi             phi;
        rho             rho;
        value           uniform (0 0 0);

//         type            zeroGradient;
    }
    top
    {
        type            slip;
    }
}


// ************************************************************************* //
