tests/HeleShaw/channel2D/src/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
    left
    {
        type            zeroGradient;
//         type            totalPressure;
//         p0              uniform 100100;
    }
    bottom
    {
        type            zeroGradient;
    }
    right
    {
        type            totalPressure;
        p0              uniform 0;
    }
    top
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
