tests/HeleShaw/channel2D/src/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
    left
    {
        type            zeroGradient;
//         type            totalPressure;
//         p0              uniform 100100;
    }
    bottom
    {
        type            fixedFluxPressure;
    }
    right
    {
        type            totalPressure;
        p0              uniform 1e5;
    }
    top
    {
        type            fixedFluxPressure;
    }
}


// ************************************************************************* //
