tests/HeleShaw/channel2D/src/0.orig/alpha.phase1
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.phase1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
    left
    {
        type            zeroGradient;
    }
    bottom
    {
//         type           dynamicAlphaContactAngle;
//         uTheta         0.1;
//         theta0         60;
//         thetaA         15;
//         thetaR         61;
//         limit          gradient;
//         value          uniform 0;

//         type            constantAlphaContactAngle;
//         theta0          40.0;
//         limit           gradient;
//         value           uniform 0;

//         type            temperatureDependentAlphaContactAngle;
//         T               T;
//         theta0          table
//         (
//             (300.0 90.0)
//             (370.0 10.0)
//         );
//         limit           gradient;
//         value           uniform 0;

        type            zeroGradient;
    }
    right
    {
        type            zeroGradient;
    }
    top
    {
//         type           dynamicAlphaContactAngle;
//         uTheta         0.1;
//         theta0         60;
//         thetaA         15;
//         thetaR         61;
//         limit          gradient;
//         value          uniform 0;

//         type            constantAlphaContactAngle;
//         theta0          40.0;
//         limit           gradient;
//         value           uniform 0;

//         type            temperatureDependentAlphaContactAngle;
//         T               T;
//         theta0          table
//         (
//             (300.0 90.0)
//             (370.0 10.0)
//         );
//         limit           gradient;
//         value           uniform 0;

        type            zeroGradient;
    }
}


// ************************************************************************* //
